Todos_part_3_coming_together/app/controllers/api/todos_controller.rb

    def index
        unless params[:todo]
            todos = Todo.all
---
SELECT "todos".* FROM "todos"